Repository: giellalt/corpus-sme
Catalog: prestable/tmx/nob2sme/facta/skuvlahistorja4/kirsten-s.htm.tmx
Source language: sme
Languages: nob

source: På norsk
nob: Sámegillii

source: Artihkal girjjis Sámi skuvlahistorjá 4 Davvi Girji 2010 .
nob: Artikkel i boka Samisk skolehistorie 4 . Davvi Girji 2010 .

source: Guovdageainnus bealjehemiid skuvlii 1940:s
nob: Fra Kautokeino til døveskole i 1940

source: Muitalan Kristin Sarai
nob: Fortalt til Kristin Sara

source: Kirsten Sara , Trondheim 1943 ( Govva : Thorleif Wardenær )
nob: Kirsten Sara , Trondheim 1943 ( Foto : Thorleif Wardenær )

source: Kristin Sara , Trondheim 1994 ( Govva : Svein Lund )
nob: Kristin Sara , Trondheim 1994 ( Foto : Svein Lund )

source: Kirsten N. Sara Ørsnes ( Ellána Risten ) riegádii Guovdageainnu boazosápmelačča jovkui 1930:s .
nob: Kirsten N. Sara Ørsnes ( Ellána Risten ) ble født i en reindriftsfamilie i Kautokeino 1930 .

source: Son lei bealjeheapmi riegádeamis juo ja sáddejuvvui Troandima almmolaš skuvlii bealjehismánáid váste go lei birrasiid 10 jahkásaš .
nob: Hun var født døv , og ble sendt til Trondheim offentlige skole for døve da hun var rundt 10 år gammel .

source: Maŋŋel bealjehemiid skuvlla son váccii ruovttudikšunoahpa Stavangera almmolaš skuvllas , bealjehis nieiddaid fidnoskuvlla ja barggai goarrun Ålesundas , biigui Guovdageainnus ja barggai dasto maŋŋil Luma lámpáfabrihkas Oslos .
nob: Etter døveskolen tok hun husmorskolen ved Stavanger offentlige skole , yrkesskole for døve piker og arbeida som syerske i Ålesund , hushjelp i Kautokeino og senere på Luma lampefabrikk i Oslo .

source: Oslos son gávnnai isida .
nob: I Oslo traff hun sin mann .

source: Soai náitaleigga ja fárriiga Tarvai , Bjugnii Lulli-Trøndelagii gos su isit oaččui návetbarggu .
nob: De giftet seg og flyttet til Tarva i Bjugn i Sør-Trøndelag , der hennes mann fikk en stilling som fjøsrøkter .

source: Maŋŋil soai osttiiga sierra dálu ja ásaiga Rissai Lulli-Trøndelagii .
nob: Seinere kjøpte de seg en egen gård og bosatte seg i Rissa i Sør-Trøndelag .

source: Sudnuide šadde 5 máná .
nob: De fikk fem barn .

source: Su nieida , Kristin Sara ( Ellána Ristena Risten ) lea riegádan 1965:s ja bajásšaddan Rissas .
nob: Hennes datter , Kristin Sara ( Ellána Ristena Risten ) er født i 1965 og oppvokst i Rissa .

source: Son lea oahppan bealjehemiid dulka ja lea 2009:s jearahallan eatnistis su mánnávuođa ja skuvlavázzima birra .
nob: Hun er utdannet døvetolk og har i 2009 intervjuet sin mor om hennes barndom og skolegang .

source: Su jearahallamii mii leat lasihan dieđuid maid leat gávdnan Guovdageainnu skuvlastivrra vuorkkáin .
nob: Intervjuet er komplettert med opplysninger som vi har funnet i Kautokeino skolestyres arkiv .

source: Mánnávuohta duoddaris
nob: Barndom på fjellet

source: Bajásšadden joavkkus duoddaris , siiddas , ja mii jođiimet bohccuiguin .
nob: Jeg vokste opp med familien på fjellet , i siidaen , og vi flyttet etter reinen .

source: Mus ledje guokte oappá ja okta viellja .
nob: Jeg hadde to søstre og en bror .

source: Lei unna servodagaš , ja mun dovden buohkaid .
nob: Det var et lite , oversiktlig samfunn og jeg kjente alle .

source: Muittán eanas ollesolbmuid in ge mánáid .
nob: Det er mest voksne jeg husker fra den tiden og ikke andre barn .

source: Soaitá danne go gulahallen buoremusat etniinan ja vieljainan .
nob: Det kan komme av at jeg kommuniserte mest med min mor og bror .

source: Ja vilbealán Nils Gaupa gal muittán bures , go son lávii leaikkastallat .
nob: Og min fetter Nils Gaup husker jeg spesielt godt , fordi har brukte å skøye .

source: Dat lea maiddái gulahallan .
nob: Det er også kommunikasjon .

source: Oappáidan ja vielljan in atnán mánnán , sii ledje oappát ja viellja .
nob: Mine søsken regnet jeg ikke som barn , de var søster eller bror .

source: Beaivválaččat stoagaimet ja barggaimet dihto bargguid .
nob: Hverdagen besto av lek og faste gjøremål .

source: Guottašin muoraid , dolastin ja vuššen gáfe .
nob: Jeg hentet ved , fyrte og kokte kaffe .

source: Ledjen čeahppi , lea eadnán muitalan .
nob: Der var jeg flink , har mor fortalt .

source: Son lávii rámpostallat , dajai mus lei buorre jurddašeaddji oaivi .
nob: Hun brukte å skryte av det og si at jeg hadde et godt hode å tenke med .

source: Moai gulahalaime cuoigumiin ja čájehallamiin .
nob: Vi kommuniserte med tegn og gester .

source: Muđui lei beana mu guoibmi .
nob: Ellers så var hunden min faste følgesvenn .

source: Ledjen hui árgi ja čiehkádin ovttatmano go guossit bohte .
nob: Jeg var veldig sky og trakk meg fort unna når det kom fremmede .

source: Mu mielas lei somá njorostallat , darvehit ja darvehallat , ja mun háliidin leat okto .
nob: Jeg likte å leke med lasso , fange og bli fanget og jeg likte å være alene .

source: Lei sorjjasmeahttun eallin .
nob: Det var et fritt liv .

source: Goitge muittán go deddojin oađidettiin ja de muhtumin lihkken ja vulgen olggos .
nob: Men jeg husker at jeg ofte hadde mareritt om nettene og da kunne det hende at jeg sto opp og gikk ut .

source: Beatnagat čuovvoledje mu álo , ja de ledjen oadjebas ja ilus .
nob: Hunden fulgte alltid etter meg og da var jeg glad og trygg .

source: Eadni várra doaivvui mu manname hivssegii , go mun in goassege muitalan ahte ledjen deddon .
nob: Mor trodde vel at jeg skulle ut på do , for jeg sa aldri noe om marerittene .

source: Muittán erenoamážit oktii go ledjen vuot vázzime ja beaivváš lei jur badjáneame .
nob: Jeg husker spesielt godt en gang jeg var ute på mine vandringer mens sola ennå sto i horisonten .

source: Fáhkkestaga fuomášin juoidá čáhppada girddašeame mu bajábealde .
nob: Plutselig så jeg noe mørkt og stort som bredde ut sine vinger og kretset over meg .

source: Goaskin dat lei .
nob: Det var en ørn .

source: Mus lei beana mielde in ge mun de ballan , šadden dušše sáhkkii .
nob: Men jeg hadde hunden med meg så jeg ble ikke redd , bare nysgjerrig .

source: Oidnen go beana dego suhtai ja rohkkáhii lotti , ja de dihten beana várjalii mu .
nob: Jeg så at hunden ble ilter og satte av gårde etter den så jeg visste at hunden passet på meg .

source: In muitalan goassege eadnásan maid vásihin go son lei hui garas muinna ii ge soaitán liikot dasa go ledjen mannan okto olggos .
nob: Jeg fortalte aldri mor hva jeg opplevde fordi hun var streng og jeg tenkte at hun ikke likte at jeg dro av gårde alene .

source: Son lávii hui gearggus gieldit mu .
nob: Hun var snar med pekefingeren og formante meg .

source: Geahččalii čájehit munnje ahte dobbelis siidda ledje eallit mat ledje vel stuorábut go beana .
nob: Hun prøvde å vise meg at det var dyr utenfor siidaen som var større enn hunden .

source: Dan mun dieđusge in ipmirdan , go in lean oaidnán dakkár ealli .
nob: Men den historien kunne jeg ikke forstå . Jeg ikke hadde sett det .

source: Sii vigge dáguhit munnje ahte doppe ledje gumppet , dat ledje várálaččat , muhto ii lean álki .
nob: De ville ha meg til å forstå at det fantes ulv som var farlig , men det var ikke lett .

source: Muhtumin áhččán ja vielljan válddiiga mu mielde vuovdái , čájeheigga ráppi .
nob: En dag tok min far og bror meg ut i skogen for å vise meg et reinkadaver .

source: Amma mu dal de ipmirdan ahte doppe leat gumppet ?
nob: Kanskje jeg da ville skjønne at det var ulv der ute ?

source: – Gea duo , – diet lea borahallan gumpii ja gumpe sáhttá borrat du maid , dajaiga garrasit munnje , muhto mun in dohkkehan in ge ipmirdan maidege maid in lean oaidnán ieš .
nob: – Se der , – den er spist av ulv og den kan spise deg også , sa de strengt til meg . Men det jeg ikke hadde sett , verken forsto eller aksepterte jeg .

source: Ledjen dan dáfus hui ceaggái .
nob: Jeg var veldig sta sånn .

source: Danne mu ipmárdusas ii gávdnon obage ealli mii lei stuorát go beana ja sáhtii borrat mu .
nob: Et dyr som var større enn en hund og som kunne spise meg eksisterte ikke i min verden .

source: Mu mielas lei somá eallit duoddaris in ge mun háliidan galledit fulkkiidan gilis in ge oađđit viesus .
nob: Jeg trivdes godt på fjellet og var ikke så glad i å besøke familie i bygda eller sove i hus .

source: Doppe orui nu gárži ja moskkus , ja mun láittastuvvagohten fargga .
nob: Da følte jeg meg innestengt og kjedet meg fort .

source: Ja gilis ledje nu ollugat geain ledje ártegis biktasat .
nob: I bygda var det dessuten så mange fremmede , som hadde så rare klær .

source: Ballen apmasiin .
nob: Jeg var redd fremmede .

source: Jurddašin ollu ipmašiid mánnán , muhto dat lei goit suohtas áigi .
nob: Jeg tenkte så mye rart da jeg var barn , men det var en morsom tid .

source: Muittán go gáđaštin vielljan danne go sus ledje bohccot .
nob: Jeg husker jeg var misunnelig på min bror som hadde rein .

source: Váidalin eadnásan , ja son lohpidii addit munnje miesi .
nob: Jeg klagde til mor og hun lovte meg faktisk en kalv .

source: Fertejin vuordit giđđii guottetáigái , muhto de ges šadden vuolgit bealjehemiid skuvlii in ge beassan oaidnit miesi stuorrume , mearka mus gal lei .
nob: Jeg måtte bare vente til våren når kalvene kom . Men dessverre ble jeg sendt av gårde til døveskolen og jeg fikk ikke se den vokse opp .

source: Ledjen hui gába dainna .
nob: Jeg var stolt av det .

source: Ovdalgo šadden vuolgit bealjehemiid skuvlii , de šattai soahti ja girdit girddašedje .
nob: Før jeg ble sendt til døveskolen , kom krigen med fly over himmelen .

source: Lei issoras .
nob: Det var voldsomt .

source: Čielgaseamos muitu lea báhcán go ledjen olgun stoahkame Elliin , oambeliin .
nob: Mitt klareste minne er at jeg var ute og lekte med Ellen , mitt søskenbarn .

source: Fáhkkestaga buohkat viehkaledje čiehkádit .
nob: Plutselig sprang alle og gjemte seg .

source: Elle čurvii munnje ja siđai doapmat .
nob: Ellen ropte på meg og sa at jeg måtte skynde meg .

source: Vihken su maŋis ja moai čiehkádeimme , muhto in ipmirdan maidege .
nob: Jeg sprang etter og gjemte meg med henne , men forsto ingenting .

source: Maŋŋelaš guovlalin olggos , ja de oidnen girdiid .
nob: Senere kikket jeg ut og først da så jeg flyene .

source: Sii muitaledje munnje ahte dat ledje várálaččat , báhče buot mii lihkadii .
nob: Alle var redd flyene . De fortalte meg at det var farlig og at de skjøt på det som rørte seg .

source: Sii čájehedje munnje vielja bissu , ja de ipmirdin ahte sii sáhttet báhčit mu .
nob: De viste meg min brors gevær og da forsto jeg at de kunne skyte meg .

source: Eadni muitalii ahte leansmánni Dahl lei leamaš min siiddas , oastán herggiid ja mannan Ruŧŧii .
nob: Min mor fortalte at lensmann Dahl hadde vært hos oss på fjellet , kjøpte rein og reist til Sverige .

source: Na mun ba dáiden ipmirdan mii dat ges lei ?
nob: Men hva forsto vel jeg hva det betydde ?

source: Ráhkadeimmet iežamet giehtasániid
nob: Laga egne tegn

source: In oahppan bealjehemiid giela nu go dálá mánát .
nob: Jeg lærte ikke tegnspråk slik som døve barn gjør nå .

source: Ii oktage diehtán bealjehemiid ja giehtagiela birra .
nob: Det var ingen som visste noe om døve og om tegnspråk .

source: In dieđe vel dan ge áibbas sihkkarit ležže go min joavku ipmirdan obage ahte mun ledjen bealjeheapmi .
nob: Jeg er ikke engang sikker på at familien skjønte at jeg var døv på det tidspunktet .

source: Mii ráhkadeimmet čájehansániid ja čujuhanlihkastagaid .
nob: Vi lagde tegn og gester .

source: Ledjen hirbmadit gesson eadnái ja villjii danne go soai leigga čeahpit ráhkadit čájehanmeahtaliid .
nob: Jeg var spesielt knyttet til min mor og bror siden de var gode på å lage tegn .

source: Oappáguovttos leigga maiddái čeahpit , muhto viellja dat muitalii munnje mii olgun dáhpáhuvai .
nob: Søstrene mine var også flinke , men det var min bror som fortalte hva som skjedde rundt omkring .

source: Soittii ealu birra , gos dat lei , ollu miesit go ledje , guđe bohccuid sii áigo njuovvat , mot njuvvet , merkejit misiid ja gean guđege boazu lei .
nob: Det kunne være om flokken , hvor de var , hvor mange kalver , hvilke av dyrene som ble slaktet , hvordan man slaktet , øremerker og hvem som eide dyrene .

source: Son lei hui čeahppi čájáhallat oaivila gorudiin , son livččii sáhttán šaddat neavttárin .
nob: Han var flink til å bruke kroppsspråk , han kunne blitt skuespiller .

source: Mii ráhkadeimmet dovdomearkkaid guđege dávvirii ja midjiide lagas gullevaš olbmuide .
nob: Vi laget tegn for konkrete ting og personer som var viktig i vårt liv .

source: Thomasis lei su iežas dovdomearka , sus lei árba muođus , ja danne dovdomearka dahkkui das .
nob: Thomas hadde et tegn , han hadde et arr på kinnet , så tegnet ble utledet av det .

source: Muhtun olbmo árvidin lei hui juhkki , ja mun áđđestallen su .
nob: Det var en jeg oppfattet som var fæl til å drikke , så jeg mimet han .

source: Vielljan oahpahii munnje bustávaid maiddái , vai beasaime čállit namaid .
nob: Men min bror lærte meg også bokstaver så vi kunne skrive navn .

source: Áidna man sealggadin dadjat lei « Bittu » , beana , « Ánte » viellja , ja « e e » , eadni .
nob: Det eneste jeg kunne si var enkle ting som « Bittu » hunden , « Ante » min bror og « e e » eadni ( mor ) .

source: Oidnen go olbmot humadedje , ja mun áđđestallen sin vaikko in ipmirdan maid sii barge .
nob: Jeg så at folk pratet med hverandre , og jeg hermet uten at jeg skjønte hva de egentlig gjorde .

source: In mun lean goit gullan hupmama .
nob: Jeg hadde jo ikke hørt tale .

source: Áidna maid muittán gullan lea beanašáikasa .
nob: Det eneste jeg husker jeg har hørt er hundeglam .

source: Ja soađi áigge gullen girdi nai .
nob: Og jeg hørte faktisk fly under krigen .

source: Lei hui issoras .
nob: Det var skremmende .

source: Buoremusat muittán girdihája .
nob: Jeg luktet dem før de kom .

source: Haksen daid ovdal go dat ihte albmái ja ovdal go dat haksogohte .
nob: De andre hørte flyene lenge før de viste seg på himmelen og lenge før de luktet .

source: Oidnen dušše go buohkat viehkaledje čiehkádit .
nob: Jeg så bare at alle sprang og gjemte seg .

source: Imaštallen go olbmot muhtumin eai ballán go girdit bohte .
nob: Det rare var at noen ganger var folk rolige når det kom fly .

source: In ipmirdan goassege manne muhtun girdit ledje várálaččat ja manne muhtumat eai lean várálaččat , muhto mun bargen nu go buohkat earát .
nob: Jeg forsto aldri hvorfor noen fly var farlige og andre ikke , men jeg gjorde som de andre .

source: Oanehis áigi Guovdageainnu álbmotskuvllas
nob: Kort opphold på Kautokeino folkeskole

source: Go ledjen deavdán čieža jagi , de eadni siđai mu álgit skuvlii Guovdageidnui daid eará mánáid mielde .
nob: Da jeg var sju år ville mor at jeg skulle begynne på skolen i Kautokeino med de andre elevene .

source: Ovddemus maid muittán lea go buohkat gehčče munnje ja háliidedje diehtit máhtán go hupmat .
nob: Det første jeg husker er alle som så på meg og lurte på om jeg kunne snakke .

source: Jerre máhtán go dadjat « A » ja « B » jna. vai gullet máhtán go hupmat .
nob: De spurte om jeg kunne si « A » og « B » osv. for å sjekke om jeg kunne prate .

source: Sii sihte mu geardduhit maid ieža dadje .
nob: De ville jeg skulle gjenta det de sa .

source: Šadden measta buohcci ja viehkalin eret .
nob: Jeg følte meg uvel og stakk meg unna .

source: Fargga sii eai jearahan šat , ja de vulgen mun nai stoahkat skuvlašilljui .
nob: Etter hvert roet det seg og jeg ble med i leken i skolegården .

source: Váivvimus muitu lea go čohkkájin skuvlapulttes in ge ipmirdan maidege .
nob: Det verste jeg husker var timene hvor jeg satt ved skolepulten og ikke forsto noen ting .

source: Buot dego girddii mu oaivvi badjel .
nob: Alt fløy over hodet på meg .

source: Oahpaheddjiin ii lean máhttu ii bealjehemiid birra ii ge giehtagiela birra , danne in ožžon oahpu .
nob: Lærerne hadde ikke kunnskap verken om døve eller tegnspråk , så jeg fikk ikke undervisning .

source: Dušše dan ipmirdit ahte oahppit čuoččahedje lávlut ?
nob: Bare det å forstå når elevene reiste seg for å synge .

source: Mas ba mun ges dihten mii lávlun lea go in lean gullan dan goassege ?
nob: Hvordan kunne jeg vite hva sang var når jeg aldri hadde hørt ?

source: Rehketdiimmuin lei maiddái ahkit .
nob: I regnetimene var det også trasig .

source: Ii oktage lean oahpahan munnje loguid .
nob: Ingen hadde lært meg noe om tall før .

source: Lei váivi go oahppit rehkenaste ja čájehedje maid sii leat bargan .
nob: Så da elevene regnet og viste meg hva de hadde gjort syntes jeg det var ekkelt .

source: Šadden leat ollu iehčanassii .
nob: Jeg ble nok mye overlatt til meg selv .

source: Maid ba hal sii muđui dihte bargat ?
nob: Hva annet skulle de gjøre ?

source: Lei suivat go oahpaheaddjit eai ge beroštan .
nob: Det var fælt at lærerne ikke brydde seg .

source: Dat gal lea mu mielas oba heitot .
nob: Det var veldig dårlig synes jeg .

source: Munnje ii lean doppe earágo dušši !
nob: For meg var det bare skit å være der !

source: Vásihin maiddái go oahppit áđđestalle mu ja njezzo munnje .
nob: Jeg opplevde også at elever apte etter meg og lage grimaser .

source: Eai sii dieđusge ipmirdan dađi eanet , muhto mun suhtten ja váidalin ollesolbmuide .
nob: De skjønte vel ikke bedre , men jeg ble sint og fortalte det til noen voksne .

source: Ipmirdin ahte sii eai beroštan , eai sii dieđusge ipmirdan , ja de mannen vielja lusa .
nob: Jeg forsto at de ikke brydde seg De skjønte ikke hva jeg sa , så jeg gikk til min bror .

source: De šattai doarru , son dieđusge bealuštii mu .
nob: Da ble det slåsskamp , for han forsvarte meg .

source: Skuvllas lei ahkit ja váivi , ja mun háliidin vuolgit ruoktot .
nob: Det var fælt å være på skolen og jeg ville hjem .

source: Internáhtas gal vel dohkkii .
nob: På internatet var det greit .

source: Dálueamit lei hui garas , ja doppe eai beassan láhttet fasttit .
nob: Husmor var streng og det var ikke noe tull der .

source: Fertejin ieš váruhit biktasiiddan ja dávviriiddan nu go eará oahppit .
nob: Jeg måtte ta vare på tøyet mitt og klare meg selv slik som de andre elevene .

source: Lihkus sii eai vealahan mu dan dáfus .
nob: Heldigvis ble jeg ikke forskjellsbehandlet sånn .

source: In gulahallan gal ovttain ge .
nob: Men jeg hadde ingen å kommunisere med .

source: Dušše oappáidanguin ja vieljainan .
nob: Bare mine søsken .

source: Fargga bođii eadni fitnat , ja de gal in šat gárron báhcit .
nob: Etter en stund kom mor på besøk og da nektet jeg å være der .

source: Háliidin ruoktot .
nob: Jeg ville hjem .

source: Dollen su ja čirron , ja nu de šattai , bessen vuolgit ruoktot .
nob: Jeg holdt henne og gråt . Så slik ble det , jeg fikk dra hjem .

source: Vázzen skuvlla moadde mánu , ja dađi eanet skuvlla in vázzán gal Guovdageainnus .
nob: Jeg gikk på skolen to - tre måneder og lengre skolegang ble det ikke for meg i Kautokeino .

source: Romssa gávpogii iskkadeapmái
nob: Til Tromsø for undersøking

source: Doaivvun ahte danne go eadni lei hupman skuvllain , de šadden doaktára lusa Romssa gávpogii .
nob: Jeg tror det var etter en samtale mellom mor og skolen at det ble ordnet slik at jeg ble undersøkt av en lege i Tromsø .

source: In ipmirdan dieđusge ahte leimmet vuolgime Romsii go vulggiimet .
nob: Jeg skjønte selvfølgelig ikke at vi skulle reise til Tromsø da vi dro dit .

source: Ipmirdin gal ahte galggaimet vuolgit fatnasa mielde , ja ahte sii áigo bidjat juoidá mu oaivái ja gorudii .
nob: Det jeg skjønte var at vi skulle av gårde med båt og at noe skulle settes på hodet og kroppen .

source: In muitte nu ollu dan mátkkis , dušše doaktárkantuvrra ja doaktára .
nob: Jeg husker ikke så mye av reisen , bare legekontoret og legen .

source: Muhtun dievdu bođii munno ovddal ja mojohalai , rávkkai buorebeaivvi .
nob: Vi ble mottatt av en smilende mann som sa god dag .

source: Son cuoiggui munnje , mu beljiide ja dollii mu gihtii , geardduhii fas .
nob: Han pekte på meg , ørene mine og tok meg i hånden bare for å gjenta dette en gang til .

source: Nivkalin .
nob: Jeg nikket .

source: Son cuoiggui ain ja galgen rabestit njálmmi .
nob: Han fortsatte å peke og så gape .

source: Mu mielas son lei ártet .
nob: Jeg syntes han var rar .

source: Ii iskkadeapmi lean dađi eanet go ahte son guovllai mu čoddagii ja beljiide .
nob: Undersøkelsen var ikke annet enn at han så i halsen og ørene .

source: Son oinnii ahte ledjen bealjeheapmi ja rávvii bidjat mu skuvlii Troandimii .
nob: Men han så at jeg var døv og anbefalte skole i Trondheim .

source: Eadni gulai ahte ledjen šaddan dakkárin go sus lei bárkodávda go váccii muinna .
nob: Mor fikk også vite at jeg var døv på grunn av røde hunder under svangerskapet .

source: Ja de moai vulggiime ruoktot .
nob: Så reiste vi hjem .

source: Go leimme ollen ruoktot , de viellja muitališgođii munnje ahte galggan vuolgit guhkás vázzit skuvlla .
nob: Da jeg var vel hjemme begynte min bror å forklare at jeg skulle reise langt vekk for å gå på skole .

source: Ipmirdin ahte ferten fas vuolgit juosat , muhto in háliidan in ge áigon gárrut vuolgit .
nob: Jeg forsto at jeg måtte reise igjen , men ville ikke og nektet .

source: Son humai garrasit munnje ja dajai « JUO » , cuoiggui mu beljiide čájehan dihte ahte mun in gula .
nob: Han sa bestemt « JO » og pekte på ørene for å vise at jeg ikke hørte .

source: Guhkkin galgen oahppat lohkat ja čállit .
nob: Langt borte skulle jeg lære å lese og skrive .

source: Son vikkai mu oažžut ipmirdit ahte son gal gulai ja danne beasai vázzit skuvlla gilis .
nob: Samtidig ville han få meg til å forstå at han hørte og derfor gikk på skole i bygda .

source: In mun diehtán ahte eanas olbmot gulle ja in ge dan ahte mun ledjen bealjeheapmi
nob: Jeg visste ikke at de fleste hørte og heller ikke at jeg var døv .

source: Guovdageainnu skuvlastivrra vuorká 1940 Ášši 10/40 Sáddet mánáid bealjehemiid skuvlii
nob: Kautokeino skolestyres arkiv 1940 Sak 10/40 Sending av barn på døveskole .

source: Ovttajienalaš mearrádus : Skuvlastivra mearrida ohcat saji Kirsten Nilsdtr .
nob: Vedtak enstemmig : Skolestyret beslutter om å søke plass for Kirsten Nilsdtr .

source: Sarai ja Anders H. Buljoi bealjehemiid skuvlii .
nob: Sara og Anders H. Buljo på døveskole .

source: Golle guokte jagi ovdalgo sáddejuvvojin bealjehemiid skuvlii .
nob: Det tok to år før jeg ble sendt til døveskolen .

source: Dasa ledje ollu sivat .
nob: Det er nok flere grunner til at det tok så lang tid .

source: Mii jođiimet ealuin , ja dálvet , dehe giđđat lei dávjá heajos siivu .
nob: Vi flyttet med flokken og når det var vinter eller vårløsning var det ofte vanskelig føre .

source: Ledjen leamaš skuvllas Guovdageainnus eai ge sis lean buorit vásáhusat das go sáddejedje mu ruovttus eret .
nob: Dessuten så hadde jeg vært på skolen i Kautokeino og man hadde dårlig erfaring med å sende meg bort .

source: Ja dasto lei vel soahti ja várálaš vánddardit .
nob: I tillegg kom krigen og da var det utrygt å reise .

source: Ja dasto vel , gii máhtii maidege bealjehemiid birra ?
nob: Dessuten , hvem kunne noe om døve ?

source: Mii oruimet guhkkin eret dakkár máhtolašvuođas .
nob: Vi bodde for langt unna slik viten .

source: Oahpásnuvven bealjehemiid skuvllas ollugiidda geat ledje doppe eret .
nob: Døve fra Alta gikk allerede på døveskolen på den tiden og de begynte ved vanlig skolealder .

source: Ráhkkanit vuolgit
nob: Forberedelser til reisen

source: Lihkus sii válde mu mielde iešguđet báikái vaikko in ipmirdan manne .
nob: Heldigvis ble jeg tatt med til steder uten at jeg forsto hvorfor .

source: Nu mun ohppen ja vásihin .
nob: Det var på den måten jeg kunne få erfaringer .

source: Mu mielas lei gal buoremus siiddas gos dihten mot buot lei ja mii dáhpáhuvai .
nob: Jeg syntes det var best å være hjemme på fjellet der alt var forutsigbart selvfølgelig .

source: Muhtin beaivvi mii manaimet Guovdageainnu boarrásiidruktui .
nob: En dag dro vi til gamlehjemmet i Kautokeino .

source: Oruimet doppe moadde beaivvi ja sii lágidedje munnje biktasiid ja eará maid dárbbašin .
nob: Vi bodde der en stund og det ble ordnet med klær og utstyr til meg .
